Tekla.Structures.ModelInternal.BentPlateTools.GetMinimumRadius(Tekla.Structures.Model.Part)
Returns the minimum radius for cylindrical sections in a given bent plate
bentPlate: the bent plate under consideration
Returns: The minimum radius for a cylindrical sections in bentPlate

Tekla.Structures.ModelInternal.BentPlateTools.GetMaximumRadius(System.Int32,Tekla.Structures.Model.ConnectiveGeometry)
Returns the maximum radius for cylindrical section with given parameters.
geometryNodeId: Cylindrical node id in the tree
geometry: Bent plate gometry containing geometryNodeId
Returns: the maximum radius for cylindrical section with given parameters.

Tekla.Structures.ModelInternal.BentPlateTools.ModifyCurveType(Tekla.Structures.Model.ConnectiveGeometry,System.Int32,System.Int32)
Modifies cylindrical section curve type of the selected geometry node to Smooth, Narrow or Wide.
geometry: The geometry tree containing the cylindrical section to be modified.
geometryNodeId: The index of the geometry node, which is its rank in the breadth-first traversal of the geometry tree (root id is 0).
newCurveType: Type of the curve to be created.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify curve type of the cylindrical surface section.